recipes/quinoa-enchilada-casserole.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Quinoa Enchilada Casserole</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Quinoa Enchilada Casserole</h1>
<p>
<a href="https://minimalistbaker.com/mediterranean-baked-sweet-potatoes/">Original link</a>
</p>

<div id="outline-container-org327fda6" class="outline-2">
<h2 id="org327fda6">Ingredients</h2>
<div class="outline-text-2" id="text-org327fda6">
<ul class="org-ul">
<li>1 cup quinoa</li>
<li>Enchilada sauce</li>
<li>Capsicum</li>
<li>Avocado</li>
<li>Green chilies</li>
<li>Corn</li>
<li>Black beans</li>
<li>Cilantro</li>
<li>Cumin</li>
<li>Chili powder</li>
<li>0.5 cup nutritional yeast</li>
<li>0.5 - 1 cup bread crumbs</li>
</ul>
</div>
</div>

<div id="outline-container-org5ba93bb" class="outline-2">
<h2 id="org5ba93bb">Method</h2>
<div class="outline-text-2" id="text-org5ba93bb">
<ol class="org-ol">
<li>In a large saucepan of 2 cups water, cook quinoa according to package instructions; set aside.</li>
<li>Preheat oven to 190&deg;C. Lightly oil an 8 by 8 or baking dish or coat with nonstick spray.</li>
<li>In a large bowl, combine quinoa, enchilada sauce, green chiles, corn, black beans, cilantro, cumin and chili powder; season with salt and pepper, to taste. Stir in nutritional yeast.</li>
<li>Spread quinoa mixture into the prepared baking dish. Top with bread crumbs. Place into oven and bake, about 15 minutes.</li>
<li>Serve immediately, garnished with avocado and tomato, if desired.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
